# Створюємо цикл.
while True:
    # Просимо ввести спотрібні данні.
    num = input("Введіть не меньше 10 цифр:")

    # Створюємо список.
    numlist = []

    # Перевіряємо чи введені потрібні данні.
    if num.isdigit() and len(num) >= 10:

        # Додаємо введені цифри в список.
        for i in num:
            numlist.append(i)

        # Використовуємо множину для визначення унікальних чисел у списку.
        uniquenum = set(num)

        # Виводимо кількість унікальних чисел.
        print(f"У списку зустрічається {len(uniquenum)} різних чисел.")

        # Виходимо з циклу.
        break

    # Указуєммо що було введено замало чисел.
    elif num.isdigit() and len(num) <= 10:
        print("Ви ввели замало цифр!")

    # Указуєммо що були введені не правильні данні.
    elif num:
        print("Ви ввели не правильний символ!")

    # Говоримо що не було введенно жодної цифри.
    else:
        print("Ви не ввели жодного символу!")
