# Просимо ввести число.
N = input("Введіть число: ")

# Присвоюємо змінній введені данні в числовому форматі
nnum = int(N)

# Перевіряємо щоб число було введено.
if N.isdigit():
    # Проходимо усі числа від 1 до N
    for num in range(1, nnum + 1):
        # Знаходимо квадрат числа
        square = num * num

        # Присвоюємо значенню тип стрінг.
        square_str = str(square)
        num_str = str(num)

        # Перевіряємо числа та видаємо результат.
        if square_str.endswith(num_str):
            print(f"{num} * {num} = {square}")


# Тут повертає повідомлення про те що були введені не підходячі символи.
elif N:
    print("Введенe значення крім цифр містить інші символи.")

# Якщо не ввели нічого в поле то видасть це повідомлення.
else:
    print("Ви не ввели ждної цифри!")