# Просимо ввести набір цифр для перевірки.
velform = input("Введіть число в якому є дві однакові цифри:")

# Проходить перевірка на корректність введеного значення
if velform.isdigit() and len(velform) >= 2:

    # Створюємо список.
    listvel = []
    # Створюємо змінну якоі по замовченням присвоюємо неістинну.
    velresult = False

    # Конвертуємо введенний набір цифр в список
    for vel in velform:
        listvel.append(vel)

    # Дізнаємося чи є 2 або більше однакоих цифри в списку:
    for char in velform:
        # Тут ми перевіряємо массу цифр на наявність 2 або більше
        # однакових цифр.
        if velform.count(char) >= 2:
            # Якщо занайшло 2 або більше однакові цифри, то значення
            # змінной змінюється на істину.
            velresult = True

    # Тут в залежності від полученного результату виводимо потрібну
    # відповідь
    if velresult:
        print("У введеному числі є дві або більше однакові цифри.")
    else:
        print("У введеному числі немає двох однакових цифр.")

# Виводе це повідомлення якшо не ввели потрібну кількість цифр.
elif len(velform) == 1:
    print("Число повинне бути двозначне або більше!")

# Тут повертає повідомлення про те що були введені не підходячі символи.
elif velform:
    print("Введенe значення крім цифр містить інші символи.")

# Якщо не ввели нічого в поле то видасть це повідомлення.
else:
    print("Ви не ввели ждної цифри!")
