text0 = """Любіть Україну, як сонце, любіть,

як вітер, і трави, і води…

В годину щасливу і в радості мить,

любіть у годину негоди.

Любіть Україну у сні й наяву,

вишневу свою Україну,

красу її, вічно живу і нову,

і мову її солов’їну.

Між братніх народів, мов садом рясним,

сіяє вона над віками…

Любіть Україну всім серцем своїм

і всіми своїми ділами.

Для нас вона в світі єдина, одна

в просторів солодкому чарі…

Вона у зірках, і у вербах вона,

і в кожному серця ударі,

у квітці, в пташині, в електровогнях,

у пісні у кожній, у думі,

в дитячий усмішці, в дівочих очах

і в стягів багряному шумі…"""

# Видаляємо розділові знаки з тексту.
textwor = (
    text0.replace(",", "").replace("…", "")
    .replace(".", "").replace("\n", " ").split()
)

# Створюємо словник.
word_count = {}

# Створення словника зі словами як ключами та кількістю
# їх входжень як значеннями.
for text in textwor:
    word_count[text] = word_count.get(text, 0) + 1

# Знаходження слова, яке зустрічається найчастіше та найрідше.
wordmax = max(word_count, key=word_count.get)
wordmin = min(word_count, key=word_count.get)

# Виводимо результат.
print(f"Слово, яке зустрічається найчастіше: '{wordmax}' - {word_count[wordmax]} разів")
print(f"Слово, яке зустрічається найрідше: '{wordmin}' - {word_count[wordmin]} разів")
