# Просимо ввести певну кількість символів
form0 = input("Введіть 15 символів розділяючі їх комою:")

# Перевіряемо щоб поле містило символи
if form0:

    # Перевіряємо щоб кількість символів була не меньше 15 символів
    # якщо кількість символів меньше то виконується множення
    # та відбувається копіювання змісту
    if len(form0) < 15:
        form0 = form0 * 3

    # Конвертуємо рядок с текстового в список та задаємо
    # розділяючий знак по якому зміст буде
    # розбиватися на індекси
    form1 = form0.split(",")
    print(form1)

    # Виводимо зі списку останні 5 елементів
    form11 = form1[-1:-6:-1]
    print(form11)

    # Виводимо список в зворотній послідовності
    form12 = form1[::-1]
    print(form12)

    # Виводимо список усіх елементів з парним індексом
    form13 = form1[::2]
    print(form13)

    # Виводимо список у якому 5 елементів спочатку
    # такі ж самі як остані 5 елементів списку
    form1[:5:] = form1[-5:]
    print(form1)

else:
    print("Ви не ввели ждного символу!")

# Також зробив другу версію, з застосуванням циклів

# Просимо ввести певну кількість символів
form0 = input("Введіть 15 символів розділяючі їх комою:")

# Перевіряемо щоб поле містило символи
if form0:

    # Перевіряємо щоб кількість символів була не меньше 15 символів
    # якщо кількість символів меньше то виконується додавання вісту
    #  до вмісту доки не буде досягнуто потрібної кількості символів
    while len(form0) < 15:
        form0 = form0 + form0

    # Конвертуємо рядок с текстового в список та задаємо
    # розділяючий знак по якому зміст буде
    # розбиватися на індекси
    form1 = form0.split(",")
    print(form1)

    # Виводимо зі списку останні 5 елементів
    form11 = form1[-1:-6:-1]
    print(form11)

    # Виводимо список в зворотній послідовності
    form12 = form1[::-1]
    print(form12)

    # Виводимо список усіх елементів з парним індексом
    form13 = form1[::2]
    print(form13)

    # Виводимо список у якому 5 елементів спочатку
    # такі ж самі як остані 5 елементів списку
    form1[:5:] = form1[-5:]
    print(form1)

else:
    print("Ви не ввели ждного символу!")
