# Тут було реалізовано пооле для вводу символів;
numb1 = input("Введіть п'ятизначне число:")

# В цій функції проходить перевірка введеного значення, перевіряється щоб були введені тільки цифри
# якщо були введені не підходящі символи то видасть відповідне повідомлення;
if numb1.isdigit():

    # Тут за допомогою ще одной змінной була реалізована функція перетвориння значиння в заокруглені цифри
    # це було зробленно для того щоб виконувалася функція divmod();
    numb2 = int(numb1)

    result1 = (numb2 // 1000) % 10
    result2 = (numb2 // 100) % 10
    result3 = (numb2 // 10) % 10
    result4 = (numb2 // 1) % 10
    result5, res1 = divmod(numb2, 3)
    result6, res2 = divmod(numb2, 7)
    # В цій функції йде перевірка кількости вказанних символів, якщо все вірно, то буде виведено результат
    # якщо кількість символів не та, то видасть помітку що не та кількість символів;
    if len(numb1) == 5:
        print(f"{result1} в розряді тисяч.")
        print(f"{result2} в розряді сотень.")
        print(f"{result3} в розряді десятків.")
        print(f"{result4} в розряді одениць.")
        print(f"{result5} трійок у числі.")
        print(f"{result6} семірок у числі.")
    else:
        print("Ви ввели не правильну кількість символів!")
else:
    print("Ви ввели неправильний символ!")
