# Тут реалізовані три пля для вводу значення;
name1 = input("Ваше Ім'я:")
name2 = input("Ваше Прізвище:")
age1 = int(input("Ваш вік:"))

# В цій змінній реалізовано віднімання указанного віку від 100 років;
residual_age = 100 - age1

# Тут був реалізований вивід результату с вітанням та компліментом про прізвище;
print(f"Доброго дня {name1}!")
print(f"{name2} це круте прізвище! Мені подобається))")

# Тут були реалізовані списки з відовідними цифрами для реалізації функції по приставці відповідного
# слова яке залежить від кількості років;
age2 = [5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,25,26,27,28,29,30,35,36,37,38,39,40,45,46,47,48,49,50,55,56,57,58,59,60,65,66,67,68,69,70,75,76,77,78,79,80,95,96,97,99,100]
age3 = [1,21,31,41,51,61,71,81,91]
age4 = [2,3,4,22,23,24,32,33,34,42,43,44,52,53,54,62,63,64,72,73,74,82,83,84,92,93,94]

# Тут задані змінні для функції перевірки та підстановки потрібного значення залежно від кількості
# решти років;
yer1 = "років"
yer2 = "роки"
yer3 = "рік"

# Тут була реалізована функція яка перевіряє решту років та в залежності від
# кількості присвоює змінній потрібне значення;

if residual_age in age2:
    yer0 = yer1
elif residual_age in age4:
    yer0 = yer2
else:
    yer0 = yer3

print(f"Також, якщо щось, до 100 років вам залишилось усього {residual_age} {yer0}!")

