print("Створення облікового запису:")

# Запрошуємо ввести данні для реєстрації
login0 = input("Придумайте Логін:")
pass0 = input("Придумайте проль:")

print("Чудово! тепер увійдіть за новими даними")

# Запрошуємо для введеня данних для входу до облікового запису
login1 = input("Введіть Логін:")
pass1 = input("Введіть Пароль:")

# Перевіряємо правельність введених данних
if login1 == login0 and pass1 == pass0:
    print("Круто! вітаємо Вас із успішною реєстрацією")

else:
    print("Ой! данні вказані невірно.")