print("Перевірка року, високосний він чи ні:")

# Просимо вказати рік який треба перевірити
yer1 = input("Введіть рік:")

# Перетворюємо рік значення повного числа
yer0 = int(yer1)

# Задаємо варіанти котрі буде показувати в залежності від результату
resyer1 = "Це високосний рік."
resyer2 = "Це не високосний рік."
resyererr= "Цей рік не підтримується"

# Дізнаємось остаток від числа
yertt1 = yer0 % 4
yertt2 = yer0 % 100
yertt3 = yer0 % 400

# Задаємо діапазон років які підтримуються
if yer0 > 1900 and yer0 < 1000000:

    # Задаємо який буде результат в залежності від року
    if (yertt1 == 0 and yertt2 != 0) or (yertt3 == 0):
        print(yer0, resyer1)
    else:
        print(yer0, resyer2)
else:
    print(resyererr)
