print("Знаходимо кількість парт яку треба закупити:")

# Тут ми запитуємо кількість учнів у кожному класі
studqua1 = int(input("Введіть кількість учні у класі №1:"))
studqua2 = int(input("Введіть кількість учні у класі №2:"))
studqua3 = int(input("Введіть кількість учні у класі №3:"))

# Тут ми узнаємо у яких класах за партою буде тільки один учень
quatabl1 = studqua1 % 2
quatabl2 = studqua2 % 2
quatabl3 = studqua3 % 2

# Тут узнаємо кількість потрібних парт
tabl1 = studqua1 // 2 + quatabl1
tabl2 = studqua2 // 2 + quatabl2
tabl3 = studqua3 // 2 + quatabl3
# Далі виводимо результат
print(f"Для класу №1 треба закупиити {tabl1} парт")
print(f"Для класу №2 треба закупиити {tabl2} парт")
print(f"Для класу №3 треба закупиити {tabl3} парт")
